app/views/studio/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."studio_id" = $1  [["studio_id", 1]]
---
  <li> Movies produced:</li>
    <%studio.movies.each do |movie| %>