app/controllers/movie_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "actors".* FROM "actors" WHERE (A Galvin)
---
  def show
    @movie = Movie.find(params[:id])
    @actors = @movie.cast
    if params[:name].present?
      #binding.pry
      @actorz = Actor.where(params[:name])

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def add_cast
  cast = Movie.find(params[:id])
  actor = Actor.find(params[:actor])